In [1]:
import pandas as pd
import numpy as np

## Students Dataset

In [2]:
df_students_raw = pd.read_csv("01 student_results.csv")

In [3]:
df_students_raw.head()

   id    name  phone sex and age test number  term 1  term 2  term 3
0   1    Mike    134        m_12      test 1      76      84      87
1   2   Linda    270        f_13      test 1      88      90      73
2   3     Sam    210        m_11      test 1      78      74      80
3   4  Esther    617        f_12      test 1      68      75      74
4   5    Mary    114        f_14      test 1      65      67      64

In [4]:
df_students_raw.shape

(10, 8)

In [5]:
df_students_raw.dtypes

id              int64
name           object
phone           int64
sex and age    object
test number    object
term 1          int64
term 2          int64
term 3          int64
dtype: object

In [6]:
df_students_raw.describe()

              id      phone     term 1     term 2     term 3
count  10.000000   10.00000  10.000000  10.000000  10.000000
mean    3.000000  269.00000  76.500000  78.400000  78.300000
std     1.490712  192.54783   8.488554   7.441625  10.274564
min     1.000000  114.00000  65.000000  67.000000  63.000000
25%     2.000000  134.00000  68.500000  74.250000  73.250000
50%     3.000000  210.00000  77.000000  77.500000  79.000000
75%     4.000000  270.00000  83.750000  83.500000  85.250000
max     5.000000  617.00000  88.000000  90.000000  94.000000

In [7]:
df_students_raw.isnull().sum()

id             0
name           0
phone          0
sex and age    0
test number    0
term 1         0
term 2         0
term 3         0
dtype: int64

 *  There are no null values in the data

 *  The sex and age columns are combined. We will split it into 2 columns

In [8]:
df_students_raw["sex"] = df_students_raw["sex and age"].str.split("_").str[0]
df_students_raw["age"] = df_students_raw["sex and age"].str.split("_").str[1]

In [9]:
df_students_raw.head()

   id    name  phone sex and age test number  term 1  term 2  term 3 sex age
0   1    Mike    134        m_12      test 1      76      84      87   m  12
1   2   Linda    270        f_13      test 1      88      90      73   f  13
2   3     Sam    210        m_11      test 1      78      74      80   m  11
3   4  Esther    617        f_12      test 1      68      75      74   f  12
4   5    Mary    114        f_14      test 1      65      67      64   f  14

In [10]:
del df_students_raw["sex and age"]

In [11]:
## Re-Order the columns
df_students_raw = df_students_raw[['id', 'name', 'sex', 'age', 'phone', 'test number', 'term 1', 'term 2', 'term 3']]

In [12]:
df_students_raw.head()

   id    name sex age  phone test number  term 1  term 2  term 3
0   1    Mike   m  12    134      test 1      76      84      87
1   2   Linda   f  13    270      test 1      88      90      73
2   3     Sam   m  11    210      test 1      78      74      80
3   4  Esther   f  12    617      test 1      68      75      74
4   5    Mary   f  14    114      test 1      65      67      64

In [13]:

df_students_long =  pd.melt(df_students_raw, id_vars=['id', 'name', 'sex', 'age', 'phone', 'test number']
        , value_vars=['term 1', 'term 2', 'term 3'])

In [14]:
df_students_long.head()

   id    name sex age  phone test number variable  value
0   1    Mike   m  12    134      test 1   term 1     76
1   2   Linda   f  13    270      test 1   term 1     88
2   3     Sam   m  11    210      test 1   term 1     78
3   4  Esther   f  12    617      test 1   term 1     68
4   5    Mary   f  14    114      test 1   term 1     65

In [15]:
### Renaming the columns
df_students_long = df_students_long.rename(columns = {"variable" : "term", "value" : "marks"})

In [16]:
df_students_long.head()

   id    name sex age  phone test number    term  marks
0   1    Mike   m  12    134      test 1  term 1     76
1   2   Linda   f  13    270      test 1  term 1     88
2   3     Sam   m  11    210      test 1  term 1     78
3   4  Esther   f  12    617      test 1  term 1     68
4   5    Mary   f  14    114      test 1  term 1     65

## Analysis

In [17]:
df_students_long.groupby(["term","test number", "sex"]).agg(marks = ("marks", "mean"))

                            marks
term   test number sex
term 1 test 1      f    73.666667
                   m    77.000000
       test 2      f    75.000000
                   m    82.500000
term 2 test 1      f    77.333333
                   m    79.000000
       test 2      f    75.666667
                   m    83.500000
term 3 test 1      f    70.333333
                   m    83.500000
       test 2      f    78.333333
                   m    85.000000

 *  We observe that on average Male students have scored higher marks in both the tests across three terms

In [18]:
df_students_long.groupby(["term","test number", "age"]).agg(marks = ("marks", "mean"))

                        marks
term   test number age
term 1 test 1      11    78.0
                   12    72.0
                   13    88.0
                   14    65.0
       test 2      11    80.0
                   12    77.5
                   13    87.0
                   14    68.0
term 2 test 1      11    74.0
                   12    79.5
                   13    90.0
                   14    67.0
       test 2      11    87.0
                   12    77.5
                   13    82.0
                   14    70.0
term 3 test 1      11    80.0
                   12    80.5
                   13    73.0
                   14    64.0
       test 2      11    80.0
                   12    84.0
                   13    94.0
                   14    63.0

 *  We observe that on 14 years old are scoring least in the tests across each term
 *  13 Years old have been the best performing studens in all the tests except Test 1 in Term 3

## UNICEF Under 5 Mortality Rate Data

In [19]:
df_unicef_u5mr = pd.read_csv("02 unicef-under_5_mortality_rate.csv")

In [20]:
df_unicef_u5mr.head()

,CountryName,U5MR 1950,U5MR 1951,U5MR 1952,U5MR 1953,U5MR 1954,U5MR 1955,U5MR 1956,U5MR 1957,U5MR 1958,...,U5MR 2006,U5MR 2007,U5MR 2008,U5MR 2009,U5MR 2010,U5MR 2011,U5MR 2012,U5MR 2013,U5MR 2014,U5MR 2015
0,Afghanistan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,116.3,113.2,110.4,107.6,105.0,102.3,99.5,96.7,93.9,91.1
1,Albania,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,19.5,18.7,17.9,17.3,16.6,16.0,15.5,14.9,14.4,14.0
2,Algeria,NaN,NaN,NaN,NaN,251.0,249.9,249.0,248.0,247.5,...,32.1,30.7,29.4,28.3,27.3,26.6,26.1,25.8,25.6,25.5
3,Andorra,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,3.7,3.6,3.5,3.4,3.3,3.2,3.1,3.0,2.9,2.8
4,Angola,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,200.5,196.4,192.0,187.3,182.5,177.3,172.2,167.1,162.2,156.9

In [21]:
df_unicef_u5mr.shape

(196, 67)

In [22]:
df_unicef_u5mr.columns

Index(['CountryName', 'U5MR 1950', 'U5MR 1951', 'U5MR 1952', 'U5MR 1953',
       'U5MR 1954', 'U5MR 1955', 'U5MR 1956', 'U5MR 1957', 'U5MR 1958',
       'U5MR 1959', 'U5MR 1960', 'U5MR 1961', 'U5MR 1962', 'U5MR 1963',
       'U5MR 1964', 'U5MR 1965', 'U5MR 1966', 'U5MR 1967', 'U5MR 1968',
       'U5MR 1969', 'U5MR 1970', 'U5MR 1971', 'U5MR 1972', 'U5MR 1973',
       'U5MR 1974', 'U5MR 1975', 'U5MR 1976', 'U5MR 1977', 'U5MR 1978',
       'U5MR 1979', 'U5MR 1980', 'U5MR 1981', 'U5MR 1982', 'U5MR 1983',
       'U5MR 1984', 'U5MR 1985', 'U5MR 1986', 'U5MR 1987', 'U5MR 1988',
       'U5MR 1989', 'U5MR 1990', 'U5MR 1991', 'U5MR 1992', 'U5MR 1993',
       'U5MR 1994', 'U5MR 1995', 'U5MR 1996', 'U5MR 1997', 'U5MR 1998',
       'U5MR 1999', 'U5MR 2000', 'U5MR 2001', 'U5MR 2002', 'U5MR 2003',
       'U5MR 2004', 'U5MR 2005', 'U5MR 2006', 'U5MR 2007', 'U5MR 2008',
       'U5MR 2009', 'U5MR 2010', 'U5MR 2011', 'U5MR 2012', 'U5MR 2013',
       'U5MR 2014', 'U5MR 2015'],
      dtype='object')

In [23]:
df_unicef_u5mr_long =  pd.melt(df_unicef_u5mr, id_vars=['CountryName']
        , value_vars=['U5MR 1950', 'U5MR 1951', 'U5MR 1952', 'U5MR 1953',
       'U5MR 1954', 'U5MR 1955', 'U5MR 1956', 'U5MR 1957', 'U5MR 1958',
       'U5MR 1959', 'U5MR 1960', 'U5MR 1961', 'U5MR 1962', 'U5MR 1963',
       'U5MR 1964', 'U5MR 1965', 'U5MR 1966', 'U5MR 1967', 'U5MR 1968',
       'U5MR 1969', 'U5MR 1970', 'U5MR 1971', 'U5MR 1972', 'U5MR 1973',
       'U5MR 1974', 'U5MR 1975', 'U5MR 1976', 'U5MR 1977', 'U5MR 1978',
       'U5MR 1979', 'U5MR 1980', 'U5MR 1981', 'U5MR 1982', 'U5MR 1983',
       'U5MR 1984', 'U5MR 1985', 'U5MR 1986', 'U5MR 1987', 'U5MR 1988',
       'U5MR 1989', 'U5MR 1990', 'U5MR 1991', 'U5MR 1992', 'U5MR 1993',
       'U5MR 1994', 'U5MR 1995', 'U5MR 1996', 'U5MR 1997', 'U5MR 1998',
       'U5MR 1999', 'U5MR 2000', 'U5MR 2001', 'U5MR 2002', 'U5MR 2003',
       'U5MR 2004', 'U5MR 2005', 'U5MR 2006', 'U5MR 2007', 'U5MR 2008',
       'U5MR 2009', 'U5MR 2010', 'U5MR 2011', 'U5MR 2012', 'U5MR 2013',
       'U5MR 2014', 'U5MR 2015'])

In [24]:
df_unicef_u5mr_long.head()

   CountryName   variable  value
0  Afghanistan  U5MR 1950    NaN
1      Albania  U5MR 1950    NaN
2      Algeria  U5MR 1950    NaN
3      Andorra  U5MR 1950    NaN
4       Angola  U5MR 1950    NaN

In [25]:
df_unicef_u5mr_long["Year"] = df_unicef_u5mr_long.variable.str.slice(5,9)

In [26]:
df_unicef_u5mr_long = df_unicef_u5mr_long[["CountryName", "Year", "value"]]

In [27]:
df_unicef_u5mr_long.columns = ["CountryName", "Year", "Mortality_Per_1000_Live_Birth"]

In [28]:
df_unicef_u5mr_long.head()

   CountryName  Year  Mortality_Per_1000_Live_Birth
0  Afghanistan  1950                            NaN
1      Albania  1950                            NaN
2      Algeria  1950                            NaN
3      Andorra  1950                            NaN
4       Angola  1950                            NaN

In [29]:
df_unicef_u5mr_long.shape

(12936, 3)

In [30]:
df_unicef_u5mr_long.isnull().sum()

CountryName                         0
Year                                0
Mortality_Per_1000_Live_Birth    2692
dtype: int64

#### We will replace Null in Mortality Per 1000 Live Birth column of Average value of that country

In [31]:
df_unicef_u5mr_long['Mortality_Per_1000_Live_Birth'] = df_unicef_u5mr_long['Mortality_Per_1000_Live_Birth'].fillna(df_unicef_u5mr_long.groupby(['CountryName'])['Mortality_Per_1000_Live_Birth'].transform('mean'))

In [32]:
df_unicef_u5mr_long.isnull().sum()

CountryName                       0
Year                              0
Mortality_Per_1000_Live_Birth    66
dtype: int64

In [33]:
df_unicef_u5mr_long[df_unicef_u5mr_long.Mortality_Per_1000_Live_Birth.isnull()]

         CountryName  Year  Mortality_Per_1000_Live_Birth
100    Liechtenstein  1950                            NaN
296    Liechtenstein  1951                            NaN
492    Liechtenstein  1952                            NaN
688    Liechtenstein  1953                            NaN
884    Liechtenstein  1954                            NaN
...              ...   ...                            ...
12056  Liechtenstein  2011                            NaN
12252  Liechtenstein  2012                            NaN
12448  Liechtenstein  2013                            NaN
12644  Liechtenstein  2014                            NaN
12840  Liechtenstein  2015                            NaN

[66 rows x 3 columns]

#### Data for Liechtenstein is not available, we will drop these rows

In [34]:
 df_unicef_u5mr_long = df_unicef_u5mr_long.dropna(subset=['Mortality_Per_1000_Live_Birth'])

In [35]:
df_unicef_u5mr_long.isnull().sum()

CountryName                      0
Year                             0
Mortality_Per_1000_Live_Birth    0
dtype: int64

In [36]:
df_unicef_u5mr_long.dtypes

CountryName                       object
Year                              object
Mortality_Per_1000_Live_Birth    float64
dtype: object

In [37]:
df_unicef_u5mr_long.Year = df_unicef_u5mr_long.Year.astype("int")

## Analysis

### Top 10 Countries with Highest under 5 in last 10 Years

In [38]:
df_unicef_u5mr_long.Year.unique()

array([1950, 1951, 1952, 1953, 1954, 1955, 1956, 1957, 1958, 1959, 1960,
       1961, 1962, 1963, 1964, 1965, 1966, 1967, 1968, 1969, 1970, 1971,
       1972, 1973, 1974, 1975, 1976, 1977, 1978, 1979, 1980, 1981, 1982,
       1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990, 1991, 1992, 1993,
       1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004,
       2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015])

In [39]:
df_unicef_u5mr_long_10_Years = df_unicef_u5mr_long[df_unicef_u5mr_long.Year > 2005]

In [40]:
highest_10_MR = df_unicef_u5mr_long_10_Years.groupby(["CountryName"]).agg(Avg_Mortality = ("Mortality_Per_1000_Live_Birth", "mean")
                                                         ).reset_index().sort_values("Avg_Mortality", ascending = False).head(10)

In [41]:
highest_10_MR

                  CountryName  Avg_Mortality
4                      Angola         179.44
33                       Chad         157.45
158                   Somalia         156.86
153              Sierra Leone         156.58
32   Central African Republic         147.87
107                      Mali         135.93
127                   Nigeria         128.96
126                     Niger         123.50
39                   Congo DR         114.86
71              Guinea-Bissau         114.34

In [42]:
### Top 10 Countries with Least under 5 in last 10 Years

In [43]:
least_10_MR = df_unicef_u5mr_long_10_Years.groupby(["CountryName"]).agg(Avg_Mortality = ("Mortality_Per_1000_Live_Birth", "mean")
                                                         ).reset_index().sort_values("Avg_Mortality", ascending = True).head(10)

In [44]:
least_10_MR

    CountryName  Avg_Mortality
76      Iceland           2.40
101  Luxembourg           2.44
154   Singapore           2.81
60      Finland           2.95
168      Sweden           3.11
85        Japan           3.18
129      Norway           3.19
156    Slovenia           3.24
3       Andorra           3.25
147  San Marino           3.43

### Countries Which have improved most from 50s to in last 10 years

In [45]:
df_unicef_u5mr_long_1950_1959 = df_unicef_u5mr_long[(df_unicef_u5mr_long.Year >= 1950) & (df_unicef_u5mr_long.Year < 1960)]

In [46]:
avg_50s_MR = df_unicef_u5mr_long_1950_1959.groupby(["CountryName"]).agg(Avg_Mortality = ("Mortality_Per_1000_Live_Birth", "mean")
                                                         ).reset_index()

In [47]:
avg_50s_MR.head()

   CountryName  Avg_Mortality
0  Afghanistan     207.218182
1      Albania      36.823684
2      Algeria     199.700968
3      Andorra       4.676923
4       Angola     210.836111

In [48]:
df_unicef_u5mr_long_2006_2015 = df_unicef_u5mr_long[(df_unicef_u5mr_long.Year >= 2006) & (df_unicef_u5mr_long.Year <= 2015)]

In [49]:
avg_2006_2015_MR = df_unicef_u5mr_long_2006_2015.groupby(["CountryName"]).agg(Avg_Mortality = ("Mortality_Per_1000_Live_Birth", "mean")
                                                         ).reset_index()

In [50]:
avg_2006_2015_MR.head()

   CountryName  Avg_Mortality
0  Afghanistan         103.60
1      Albania          16.48
2      Algeria          27.74
3      Andorra           3.25
4       Angola         179.44

In [51]:
merged_MR = pd.merge(avg_2006_2015_MR, avg_50s_MR , how = "inner", on = "CountryName")

In [52]:
merged_MR.head()

   CountryName  Avg_Mortality_x  Avg_Mortality_y
0  Afghanistan           103.60       207.218182
1      Albania            16.48        36.823684
2      Algeria            27.74       199.700968
3      Andorra             3.25         4.676923
4       Angola           179.44       210.836111

In [53]:
merged_MR.columns = ["CountryName", "2006_2015_MR", "1950_1959_MR"]

In [54]:
merged_MR.head()

   CountryName  2006_2015_MR  1950_1959_MR
0  Afghanistan        103.60    207.218182
1      Albania         16.48     36.823684
2      Algeria         27.74    199.700968
3      Andorra          3.25      4.676923
4       Angola        179.44    210.836111

In [55]:
merged_MR["diff"] =  (merged_MR["2006_2015_MR"] - merged_MR["1950_1959_MR"])
merged_MR["percentage_diff"] =  ((merged_MR["2006_2015_MR"] - merged_MR["1950_1959_MR"]) / merged_MR["1950_1959_MR"])

In [56]:
merged_MR.head()

   CountryName  2006_2015_MR  1950_1959_MR        diff  percentage_diff
0  Afghanistan        103.60    207.218182 -103.618182        -0.500044
1      Albania         16.48     36.823684  -20.343684        -0.552462
2      Algeria         27.74    199.700968 -171.960968        -0.861092
3      Andorra          3.25      4.676923   -1.426923        -0.305099
4       Angola        179.44    210.836111  -31.396111        -0.148912

### 10 Countries with highest percentage reduction in Under 5 Mortality rate

In [57]:
merged_MR.sort_values("percentage_diff").head(10)

      CountryName  2006_2015_MR  1950_1959_MR        diff  percentage_diff
91      Korea Rep          4.14    183.418000 -179.278000        -0.977429
139      Portugal          3.93     90.285484  -86.355484        -0.956471
85          Japan          3.18     63.240000  -60.060000        -0.949715
161         Spain          4.66     80.880000  -76.220000        -0.942384
83          Italy          3.92     66.950000  -63.030000        -0.941449
154     Singapore          2.81     46.286774  -43.476774        -0.939292
12        Bahrain          8.17    134.443000 -126.273000        -0.939231
40   Cook Islands          9.86    144.964154 -135.104154        -0.931983
173      Thailand         14.39    180.270000 -165.880000        -0.920175
179        Turkey         18.90    226.589524 -207.689524        -0.916589

### 10 Countries with highest absolute reduction in Under 5 Mortality rate

In [58]:
merged_MR.sort_values("diff").head(10)

      CountryName  2006_2015_MR  1950_1959_MR        diff  percentage_diff
26   Burkina Faso        114.05    373.090000 -259.040000        -0.694310
150       Senegal         64.68    323.010000 -258.330000        -0.799759
80           Iraq         36.07    279.930000 -243.860000        -0.871146
18          Benin        110.56    333.960000 -223.400000        -0.668942
131      Pakistan         90.54    311.512000 -220.972000        -0.709353
52          Egypt         28.67    244.938525 -216.268525        -0.882950
136          Peru         20.85    236.804063 -215.954063        -0.911953
175          Togo         89.88    301.640000 -211.760000        -0.702029
78      Indonesia         32.83    243.636462 -210.806462        -0.865250
13     Bangladesh         48.99    257.451429 -208.461429        -0.809712

## Titanic Dataset

In [59]:
df_titanic_raw = pd.read_csv("03 Titanic.csv")

In [60]:
df_titanic_raw.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [61]:
df_titanic_raw.shape

(891, 12)

In [62]:
df_titanic_raw.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [63]:
## Renaming Columns
df_titanic_raw.columns = ['PassengerId', 'Survived', 'PassengerClass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']

In [64]:
df_titanic_raw.isnull().sum()

PassengerId         0
Survived            0
PassengerClass      0
Name                0
Sex                 0
Age               177
SibSp               0
Parch               0
Ticket              0
Fare                0
Cabin             687
Embarked            2
dtype: int64

#### We will replace Null in age with mean value. We will use Mean at Sex x Passenger Class Level to fill null values. This is because average age will be different across gender and passenger class

In [65]:
df_titanic_raw.groupby(['Sex', "PassengerClass"], as_index=False)[["Age"]].mean()

      Sex  PassengerClass        Age
0  female               1  34.611765
1  female               2  28.722973
2  female               3  21.750000
3    male               1  41.281386
4    male               2  30.740707
5    male               3  26.507589

In [66]:
df_titanic_raw['Age'] = df_titanic_raw['Age'].fillna(df_titanic_raw.groupby(['Sex', 'PassengerClass'])['Age'].transform('mean'))

In [67]:
df_titanic_raw.isnull().sum()

PassengerId         0
Survived            0
PassengerClass      0
Name                0
Sex                 0
Age                 0
SibSp               0
Parch               0
Ticket              0
Fare                0
Cabin             687
Embarked            2
dtype: int64

#### We will replace Null in Fare column of Average Fare that passenger class

In [68]:
df_titanic_raw.groupby(["PassengerClass"], as_index=False)[["Fare"]].mean()

   PassengerClass       Fare
0               1  84.154687
1               2  20.662183
2               3  13.675550

In [69]:
df_titanic_raw['Fare'] = df_titanic_raw['Fare'].fillna(df_titanic_raw.groupby(['PassengerClass'])['Fare'].transform('mean'))

In [70]:
df_titanic_raw.isnull().sum()

PassengerId         0
Survived            0
PassengerClass      0
Name                0
Sex                 0
Age                 0
SibSp               0
Parch               0
Ticket              0
Fare                0
Cabin             687
Embarked            2
dtype: int64

#### We will replace Null in Embarked Column with mode

In [71]:
df_titanic_raw[["Embarked"]].mode()

  Embarked
0        S

In [72]:
df_titanic_raw[["Embarked"]] = df_titanic_raw[["Embarked"]].fillna("S")

In [73]:
df_titanic_raw.isnull().sum()

PassengerId         0
Survived            0
PassengerClass      0
Name                0
Sex                 0
Age                 0
SibSp               0
Parch               0
Ticket              0
Fare                0
Cabin             687
Embarked            0
dtype: int64

#### We cannot clean the null values in the Cabin columns as it's detail is specific to each passenger's ticket

## Analysis

#### What is number of survivors and survival rate by Sex?

In [74]:
df_titanic_raw.groupby("Sex").agg(survived = ("Survived", 'sum')
                                 ,survival_rate = ("Survived", 'mean')).reset_index()

      Sex  survived  survival_rate
0  female       233       0.742038
1    male       109       0.188908

 *  We observe a higher survival rate in Females. This is excected as females were evacuated first.

#### What is number of survivors by Age Group?

In [75]:
### Creating Age Group Column
df_titanic_raw["Age_Group"] = np.where(np.floor(df_titanic_raw["Age"]) < 13, "12 or Less", 
        np.where(np.floor(df_titanic_raw["Age"]) <= 18, "13 to 18", 
                np.where(np.floor(df_titanic_raw["Age"]) <= 25, "19 to 25",
                        np.where(np.floor(df_titanic_raw["Age"]) <= 35, "26 to 35",
                                np.where(np.floor(df_titanic_raw["Age"]) <= 45, "36 to 45",
                                        np.where(np.floor(df_titanic_raw["Age"]) <= 55, "46 to 55", "56 or Above" ))))))

In [76]:
#df_titanic_raw[["Age_Group", "Age"]].drop_duplicates().sort_values("Age")

In [77]:
df_titanic_raw.groupby(["Age_Group"]).agg(survived = ("Survived", 'sum')
                                 ,survivor_rate = ("Survived", 'mean')).reset_index()

     Age_Group  survived  survivor_rate
0   12 or Less        40       0.579710
1     13 to 18        30       0.428571
2     19 to 25        79       0.387255
3     26 to 35       105       0.338710
4     36 to 45        50       0.364964
5     46 to 55        26       0.419355
6  56 or Above        12       0.307692

 *  We observe a higher survival rate for Children. Again, this is excected as children would have been given priority while evacuation.

 *    We also notice that survival rate is least in oldest age group. This is probably due to harsh weather conditions.